{"meta":{"title":"/home/hafizh","subtitle":"note for future me","description":null,"author":"Hafizh Hasrindra","url":"http://fizzter149.github.io"},"pages":[{"title":"Kategori","date":"2017-02-18T02:18:20.000Z","updated":"2017-02-18T02:18:20.000Z","comments":true,"path":"categories/index.html","permalink":"http://fizzter149.github.io/categories/index.html","excerpt":"","text":""},{"title":"Tags","date":"2017-02-17T18:57:17.000Z","updated":"2017-02-17T18:57:17.000Z","comments":true,"path":"tags/index.html","permalink":"http://fizzter149.github.io/tags/index.html","excerpt":"","text":""},{"title":"About","date":"2017-02-17T19:08:34.000Z","updated":"2017-02-17T18:41:40.000Z","comments":true,"path":"about/index.html","permalink":"http://fizzter149.github.io/about/index.html","excerpt":"","text":""}],"posts":[{"title":"Usaha Meningkatkan Kualitas Tidur","slug":"usaha-meningkatkan-kualitas-tidur","date":"2017-02-18T06:02:50.000Z","updated":"2017-02-18T06:47:21.000Z","comments":true,"path":"2017-02-18-usaha-meningkatkan-kualitas-tidur/","link":"","permalink":"http://fizzter149.github.io/2017-02-18-usaha-meningkatkan-kualitas-tidur/","excerpt":"Kerja sampe larut malem, perjalanan macet, sampai rumah udah hampir ganti hari, ga heran kalau besoknya susah bangun pagi. Tapi seenggaknya ada beberapa usaha yang bisa dilakukan untuk memperbaiki kebiasaan ini.","text":"Kerja sampe larut malem, perjalanan macet, sampai rumah udah hampir ganti hari, ga heran kalau besoknya susah bangun pagi. Tapi seenggaknya ada beberapa usaha yang bisa dilakukan untuk memperbaiki kebiasaan ini. 1. MandiAwalnya, mungkin biasa aja tidur dalam keadaan badan masih lengket dan bau. Tapi dengan ngebiasain badan bersih dan seger sebelum nyentuh kasur, kualitas tidur bisa meningkat. Kalo males mandi karena alasan dingin, bisa coba dulu mandi pake air anget. Kalo masih males juga, minimal cuci muka, cuci kaki, sama sikat gigi deh. Dan jangan lupa ganti baju yang bersih. Ga lucu kalo tidur masih pake baju kantor. Intinya, buat badan senyaman mungkin waktu tidur. 2. Jauh-jauh dari gadgetMau itu dari hape, laptop, tv, usahain begitu kita mau tidur, mata kita jangan kena paparan sinar layar lagi. Ga disadari, cahaya dari gadget merangsang otak untuk selalu aktif. Alhasil, lebih susah ngajak otak untuk istirahat. Pernah kan, udah mau tidur tapi pikiran kemana-mana? Salah satunya karena ini. Kalo emang harus ngecek hape karena mungkin ada urusan kantor mendadak, bisa pakai aplikasi filter sinar biru, banyak yang bisa dipilih di play store. Aplikasi ini bisa bantu bikin layar hape agak redup &amp; kemerahan supaya ga terlalu sakit di mata. 3. ShalatYup, meditasi bisa membantu untuk mengistirahatkan pikiran. Dan sebagai umat Islam, ga ada salahnya menyempatkan 5-10 menit untuk menenangkan hati &amp; pikiran sambil retrospective sama Allah tentang apa yang udah dijalani selama sehari ini. 4. Matiin lampuWalaupun udah merem, cahaya lampu bisa bikin otak tetep aktif karena dia pikir hari belum malem. Apalagi kalo lampu yang kita pakai jenis lampu TL/neon. Ada baiknya untuk kamar pakai jenis lampu yang cahaya nya soft/dop. Selain itu, matikan sumber suara yang sekiranya bisa jadi distraksi, seperti tv atau radio. Ga usah takut tidur sepi nyenyet &amp; gelap-gelapan, kan tadi udah shalat, insya Allah selama tidur ada yang melindungi. 5. Berdoa sebelum tidurTutup semua usaha di atas dengan doa. بِسْمِكَ اللّهُمَّ اَحْيَا وَاَمُوْتُ Selamat tidur.","categories":[{"name":"uncategorized","slug":"uncategorized","permalink":"http://fizzter149.github.io/categories/uncategorized/"}],"tags":[{"name":"life","slug":"life","permalink":"http://fizzter149.github.io/tags/life/"},{"name":"sleep","slug":"sleep","permalink":"http://fizzter149.github.io/tags/sleep/"}]},{"title":"Setup Blog di Github Pages","slug":"setup-blog-di-github-pages","date":"2017-02-17T18:09:31.000Z","updated":"2017-02-18T05:58:37.000Z","comments":true,"path":"2017-02-18-setup-blog-di-github-pages/","link":"","permalink":"http://fizzter149.github.io/2017-02-18-setup-blog-di-github-pages/","excerpt":"Langkah mudah setup blog pribadi di github pages. Blog engine yang digunakan adalah Hexo, walaupun pada dasarnya github pages bisa digunakan untuk serve static website.","text":"Langkah mudah setup blog pribadi di github pages. Blog engine yang digunakan adalah Hexo, walaupun pada dasarnya github pages bisa digunakan untuk serve static website. Yang dibutuhkan Git Node Langkah-langkahdi github: buat repo &lt;nama-blog&gt;.github.io catat url repo di console: Install cli untuk blog engine Hexo 1npm install -g hexo-cli Buat project blog baru 12hexo init new-blogcd new-blog Sesuaikan pengaturan 1vi _config.yml contoh, untuk deploy: 123deploy: type: git repo: &lt;url repo github yang sudah dicatat sebelumnya&gt; Untuk deploy: 1hexo deploy selesaihttps://&lt;nama-blog&gt;.github.io is up! Selain Hexo, ada banyak alternatif blogging engine, contohnya jekyll.","categories":[{"name":"uncategorized","slug":"uncategorized","permalink":"http://fizzter149.github.io/categories/uncategorized/"}],"tags":[{"name":"blog","slug":"blog","permalink":"http://fizzter149.github.io/tags/blog/"},{"name":"github","slug":"github","permalink":"http://fizzter149.github.io/tags/github/"}]}]}